areapice = [
    {"地域":"東京都", "会社" : "ＬＩＮＫ株式会社", "住所": "東京都中央区日本橋人形町", "値段": "９５円"},
    {"地域":"東京都", "会社" : "ベネリックデジタルエンターテインメント株式会社", "住所": "東京都千代田区神田駿河台２丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "株式会社ＤＴＧ", "住所": "東京都中央区晴海１丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "ＮＹＨＡＫＴｒａｄｉｎｇ合同会社", "住所": "東京都港区南青山２丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "一般財団法人ロートこどもみらい財団", "住所": "東京都港区海岸１丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "株式会社Ｊｅｔｔｙ　Ｐｒｏｄｕｃｔｉｏｎ", "住所": "東京都品川区東品川４丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "グリービズ株式会社", "住所": "東京都品川区西五反田６丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "一般財団法人こんどＢ", "住所": "東京都大田区萩中２丁目", "値段": "９５円"},
    {"地域":"東京都", "会社" : "日本ＡＤＩＧＩ株式会社", "住所": "東京都新宿区百人町", "値段": "９５円"},
    {"地域":"東京都", "会社" : "キッコージン合同会社", "住所": "東京都新宿区新宿２丁目", "値段": "９５円"},#ここまで東京
    
    {"地域":"千葉県", "会社" : "アートブレーリ株式会社", "住所": "千葉県市川市市川南１丁目", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "シンフォニティ株式会社", "住所": "千葉県市川市市川１丁目", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "合同会社オフィスＫＡＯＲＩ", "住所": "千葉県船橋市本町", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "みらいブライト株式会社", "住所": "千葉県船橋市湊町", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "医療法人社団ＭｅｄｉｃａｌＫ", "住所": "千葉県旭市イの２６７６", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "株式会社プラススタイル", "住所": "千葉県銚子市中央町", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "ＳｐａｃｅＶｉｌｌａ合同会社", "住所": "千葉県船橋市習志野台４丁目", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "医療法人社団Ｗｅｌｌｂｅｉｎｇ", "住所": "千葉県千葉市美浜区真砂４丁目", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "医療法人社団幸道会", "住所": "千葉県千葉市中央区富士見２丁目", "値段": "１０５円"},
    {"地域":"千葉県", "会社" : "株式会社ＷｅｓｔＰａｒｋ", "住所": "千葉県千葉市中央区富士見２丁目", "値段": "１０５円"},#ここまで千葉
    
    {"地域":"埼玉県", "会社" : "株式会社アルフグループ建設", "住所": "埼玉県川口市戸塚東１丁目", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "Ｅｔｈｉｃ＆Ｓｕｓｔａｉｎａ．合同会社", "住所": "埼玉県所沢市旭町", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "医療法人社団朝柳会", "住所": "埼玉県熊谷市佐谷田字不動堂７４３", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "医療法人結蒼会", "住所": "埼玉県行田市栄町", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "株式会社夢犬", "住所": "埼玉県蕨市北町", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "株式会社ゴトウ", "住所": "埼玉県越谷市大字下間久里３５５", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "株式会社ＳＵＲＦ", "住所": "埼玉県上尾市東町", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "合同会社ｆｕｊｉｔｏｍｏ－ＰＲ", "住所": "埼玉県さいたま市見沼区大字御蔵３７６", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "株式会社アーバンライフアーキテクチュア", "住所": "埼玉県川越市菅原町", "値段": "１０５円"},
    {"地域":"埼玉県", "会社" : "株式会社皐月", "住所": "埼玉県川越市大字下赤坂７５２", "値段": "１０５円"},#ここまで埼玉
    
    {"地域":"大阪府", "会社" : "株式会社ＭＩＲＯ", "住所": "PCB", "値段": "１１５円"},
    {"地域":"大阪府", "会社" : "合同会社ビービーアイランド", "住所": "大阪府大阪市阿倍野区阿倍野筋５丁目", "値段": "１１５円"},
    {"地域":"大阪府", "会社" : "一般社団法人星十色", "住所": "大阪府交野市星田８丁目", "値段": "１１５円"},
    {"地域":"大阪府", "会社" : "株式会社さくら工務店", "住所": "大阪府大阪市中央区法円坂１丁目", "値段": "１１５円"},
    {"地域":"大阪府", "会社" : "ＳＫアライアンス株式会社", "住所": "大阪府大阪市西区本田２丁目", "値段": "１１５円"},#ここまで大阪
    
    {"地域":"愛知県", "会社" : "株式会社ＴＣ", "住所": "愛知県名古屋市中区栄５丁目", "値段": "１１５円"},
    {"地域":"愛知県", "会社" : "合同会社福田商会", "住所": "愛知県豊明市間米町", "値段": "１１５円"},
    {"地域":"愛知県", "会社" : "株式会社ＭｏｕｎｔａｉｎＲｅｃｏｒｄｓ", "住所": "愛知県名古屋市中区大須４丁目", "値段": "１１５円"},
    {"地域":"愛知県", "会社" : "株式会社ＯＲｃａｓａ", "住所": "愛知県一宮市千秋町", "値段": "１１５円"},
    {"地域":"愛知県", "会社" : "Ｕｍｂｒｅｌｌａ株式会社", "住所": "愛知県名古屋市緑区藤塚３丁目", "値段": "１１５円"},#ここまで愛知
    
    {"地域":"徳島県", "会社" : "一般社団法人アンビタス", "住所": "徳島県阿南市新野町", "値段": "１１５円"},
    {"地域":"徳島県", "会社" : "株式会社鬼ケ岩屋工学研究所", "住所": "徳島県徳島市南田宮２丁目", "値段": "１１５円"},
    {"地域":"徳島県", "会社" : "株式会社ツツイメディカルコーポレーション", "住所": "徳島県吉野川市鴨島町", "値段": "１１５円"},
    {"地域":"徳島県", "会社" : "株式会社セキュリティガーディアン", "住所": "徳島県名西郡石井町", "値段": "１１５円"},
    {"地域":"徳島県", "会社" : "美波タクシー株式会社", "住所": "徳島県海部郡美波町", "値段": "115円"},#ここまで徳島
    
    {"地域":"香川県", "会社" : "株式会社ＹＡＮＯ", "住所": "香川県坂出市川津町", "値段": "１１５円"},
    {"地域":"香川県", "会社" : "株式会社ＬＩＥＭＯ", "住所": "香川県善通寺市下吉田町", "値段": "１１５円"},
    {"地域":"香川県", "会社" : "ＰＭＣ合同会社", "住所": "香川県観音寺市本大町", "値段": "１１５円"},
    {"地域":"香川県", "会社" : "サードＬｉｆｅプランニング合同会社", "住所": "香川県高松市桜町", "値段": "１１５円"},
    {"地域":"香川県", "会社" : "株式会社レフコ", "住所": "香川県丸亀市田村町", "値段": "１１５円"},#ここまで香川

    {"地域":"福井県", "会社" : "一般社団法人ＴＲＧ", "住所": "福井県敦賀市若泉町", "値段": "１１５円"},
    {"地域":"福井県", "会社" : "社会保険労務士法人ＭＭＣ", "住所": "福井県大野市本町", "値段": "１１５円"},
    {"地域":"福井県", "会社" : "株式会社エリーゼ", "住所": "福井県福井市開発４丁目", "値段": "１１５円"},
    {"地域":"福井県", "会社" : "株式会社ウルトラ", "住所": "福井県福井市開発４丁目", "値段": "１１５円"},
    {"地域":"福井県", "会社" : "ネクストサービス株式会社", "住所": "福井県越前市丹生郷町", "値段": "１１５円"},#ここまで福井

    {"地域":"鹿児島県", "会社" : "株式会社きはら", "住所": "鹿児島県志布志市有明町", "値段": "１１５円"},
    {"地域":"鹿児島県", "会社" : "九州マルタカ合同会社", "住所": "鹿児島県鹿児島市坂之上３丁目", "値段": "１１５円"},
    {"地域":"鹿児島県", "会社" : "司法書士法人いわいばら事務所", "住所": "鹿児島県鹿屋市新川町", "値段": "１１５円"},
    {"地域":"鹿児島県", "会社" : "株式会社Ａ・Ｏ・Ｔ", "住所": "鹿児島県鹿児島市伊敷２丁目", "値段": "１１５円"},
    {"地域":"鹿児島県", "会社" : "合同会社桜大和", "住所": "鹿児島県鹿児島市上之園町", "値段": "１１５円"},#ここまで鹿児島

    {"地域":"岡山県", "会社" : "株式会社藤井石材店", "住所": "岡山県高梁市巨瀬町", "値段": "１１５円"},
    {"地域":"岡山県", "会社" : "株式会社明成", "住所": "岡山県岡山市北区田中１４９", "値段": "１１５円"},
    {"地域":"岡山県", "会社" : "株式会社Ｋｙｏｋｕ", "住所": "岡山県岡山市中区門田本町", "値段": "１１５円"},
    {"地域":"岡山県", "会社" : "美星農機株式会社", "住所": "岡山県井原市美星町", "値段": "１１５円"},
    {"地域":"岡山県", "会社" : "西日本ショウエイ協同組合", "住所": "岡山県岡山市北区西古松１丁目", "値段": "１１５円"},#ここまで岡山

    {"地域":"広島県", "会社" : "株式会社地域の風", "住所": "広島県福山市木之庄町", "値段": "１１５円"},
    {"地域":"広島県", "会社" : "株式会社日章自動車", "住所": "広島県尾道市高須町", "値段": "１１５円"},
    {"地域":"広島県", "会社" : "大瀧ベンダー株式会社", "住所": "広島県広島市南区出島２丁目", "値段": "１１５円"},
    {"地域":"広島県", "会社" : "株式会社ＭＯＮＳＯＯ", "住所": "広島県広島市西区草津南１丁目", "値段": "１１５円"},
    {"地域":"広島県", "会社" : "合同会社マブハイ・コーポレーション", "住所": "広島県東広島市西大沢１丁目", "値段": "１１５円"},#ここまで広島

    {"地域":"北海道", "会社" : "合同会社ＮＴＮ", "住所": "北海道札幌市白石区本郷通２丁目", "値段": "１１５円"},
    {"地域":"北海道", "会社" : "株式会社エンゼルジャパン", "住所": "北海道旭川市東光六条１丁目", "値段": "１１５円"},
    {"地域":"北海道", "会社" : "株式会社みらいハウス", "住所": "北海道函館市湯川町", "値段": "１１５円"},
    {"地域":"北海道", "会社" : "株式会社ヴィジョン", "住所": "北海道札幌市豊平区平岸六条１３丁目", "値段": "１１５円"},
    {"地域":"北海道", "会社" : "株式会社ＵＰＫＥＥＰ", "住所": "北海道札幌市中央区南四条西２０丁目", "値段": "１１５円"},#ここまで北海道

    {"地域":"長崎県", "会社" : "株式会社高山", "住所": "長崎県東彼杵郡波佐見町", "値段": "１１５円"},
    {"地域":"長崎県", "会社" : "合同会社ベストフレンド", "住所": "長崎県長崎市大宮町", "値段": "１１５円"},
    {"地域":"長崎県", "会社" : "株式会社エスワン", "住所": "長崎県西彼杵郡長与町", "値段": "１１５円"},
    {"地域":"長崎県", "会社" : "一般社団法人自然と大地の会", "住所": "長崎県長崎市琴海戸根町", "値段": "１１５円"},
    {"地域":"長崎県", "会社" : "株式会社ラヴィ", "住所": "長崎県西彼杵郡時津町", "値段": "１１５円"},#ここまで長崎

    {"地域":"静岡県", "会社" : "株式会社ＦＲＡＭＥ", "住所": "静岡県沼津市松長７７８", "値段": "１１５円"},
    {"地域":"静岡県", "会社" : "東煌株式会社", "住所": "静岡県静岡市清水区北脇新田６３２", "値段": "１１５円"},
    {"地域":"静岡県", "会社" : "株式会社ＫＴＳアソシエーション", "住所": "静岡県浜松市中区東伊場１丁目", "値段": "１１５円"},
    {"地域":"静岡県", "会社" : "株式会社ＴＥＤ", "住所": "静岡県袋井市葵町", "値段": "１１５円"},
    {"地域":"静岡県", "会社" : "株式会社山田空工設備", "住所": "静岡県浜松市中区天神町", "値段": "１１５円"},#ここまで静岡

    {"地域":"山口県", "会社" : "株式会社アイ・ダブル・シー", "住所": "山口県岩国市昭和町", "値段": "１１５円"},
    {"地域":"山口県", "会社" : "ＳＡＩＫＹＯ　ＴＲＡＤＥ株式会社", "住所": "山口県宇部市厚南中央１丁目", "値段": "１１５円"},
    {"地域":"山口県", "会社" : "事業承継・Ｍ＆Ａマネジメント株式会社", "住所": "山口県下関市秋根上町", "値段": "１１５円"},
    {"地域":"山口県", "会社" : "Ｅｐｉｃｕｐ　Ｇｌｏｂａｌ合同会社", "住所": "山口県山口市小郡令和１丁目", "値段": "１１５円"},
    {"地域":"山口県", "会社" : "株式会社船戸測量設計", "住所": "山口県光市室積１丁目", "値段": "１１５円"},#ここまで山口
    ]#ここまでが地域と企業名兼住所名記録
      

while True:
    choice = input(''' 
--------------
                                        【地域と料金検索】入力 / 検索

                                            1. 地域と料金入力

                                            2. 地域名で検索 

                                            3. 会社名で検索 

                                            4. 住所名で検索 

                                            5. 値段で検索 

                                            6. 終了


                                                 ＊注意
                                      ー　必ず短く書かないように注意
                                          例＝＞大阪府◎　＝＞大阪×

                                      ー　必ず短く書かないように注意
                                          例＝＞株式会社ＦＲＡＭＥ◎　＝＞株式会社×


                                　
                                    　入力番号選択(1, 2, 3, 4, 5, 6) :''')


    
    if choice == '１':   #詳細入力
        dict = {}
        dict["地域"] = input("地域名 >>")
        dict["会社"] = input("会社名 >>")
        dict["住所"] = input("住所 >> ")
        dict["値段"] = input("値段 >> ")
        areapice.append(dict)
        continue
        
    elif choice == '２':  #地域
        kwd = "地域"
        pass
    elif choice == '３':   #会社
        kwd = "会社"
        pass
    elif choice == '４':   #住所
        kwd = "住所"
        pass
    elif choice == '５':   #値段
        kwd = "値段"
        pass
    elif choice == '６':   #修了
        break
    else:
        print("間違いました。")
        continue

    userin = input(kwd + ">>>")
    find = False

    for area in areapice:
        if userin == area[kwd]:
            print("地域: ", area["地域"])
            print("会社: ", area["会社"])
            print("住所: ", area["住所"])
            print("値段: ", area["値段"])
            find = True

    if find == False:
        print("検索した内容がありません。")
        
